it-service/ssl/Documents/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Зарплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

it-service/ssl/Documents/Зарплата/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Зарплата.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Зарплата.Дата КАК Дата,
	|	Зарплата.ITСервис КАК ITСервис,
	|	Зарплата.Месяц КАК Месяц,
	|	Зарплата.Номер КАК Номер,
	|	Зарплата.Оплата КАК Оплата,
	|	Зарплата.Сотрудники.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		Начисления КАК Начислено,
	|		Оклад КАК Оклад,
	|		Сумма КАК Сумма
	|	) КАК Сотрудники
	|ИЗ
	|	Документ.Зарплата КАК Зарплата
	|ГДЕ
	|	Зарплата.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Разделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
				
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл       
			ТабДок.Вывести(ОбластьЗаголовок);
		    Шапка.Параметры.Заполнить(Выборка);
		    ТабДок.Вывести(Шапка, Выборка.Уровень());
            СуммаИтог = 0;                            
			ТабДок.Вывести(ОбластьСотрудникиШапка);
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		    СуммаИтог = СуммаИтог + ВыборкаСотрудники.Сумма;         
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Подвал.Параметры.Ответственный = ТекПользователь;
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);        
		ТабДок.Вывести(Разделитель);
        ТабДок.ВывестиГоризонтальныйРазделительСтраниц();  
		ТабДок.Вывести(Разделитель);
		КонецЦикла;  
   КонецЦикла;
	//}}
КонецПроцедуры
